package usr.schedule;

/*
Необходимо реализовать простое расписание, позволяющее добавлять задачи,
(так как на данном этапе мы занем только о существовании массивов, а для
полноценной	реализации необходимо использовать как минимум ArrayList, то
введем ограничение в 10 задач в день) выводить их на экран и сохранять в файл.

Программа должна состоять из 3х классов:
1. Запускающий.
2. Класс задача.
3. Класс планировщик, добавляющий в календарь задачи.
Методы для печати и сохранения в файл можно реализолвать в
классе "Планировщик".
*/

import java.util.Scanner;

public class testScheduler {
	public static void main(String[] args) {

		Launch.start();
	}
}
